loadtest/ramp.yml
# interviewd ramp test — find the saturation point.
#
# Run:    npx artillery run loadtest/ramp.yml
#         (or: make load-ramp)
#
# Watch in Grafana ("Interviewd Ops", localhost:3000):
#   - worker/api replica panels step up as depth and p95 cross thresholds
#   - queue depth climbs during each phase, drains between/after if capacity holds
#   - enqueued/s vs processed/s: while processed keeps pace, depth is bounded
#
# Saturation point: the arrival rate at which enqueued/s persistently exceeds
# processed/s with workers pinned at max (8) — queue depth diverges instead of
# draining. Record it in docs/load-testing.md.
#
# Early GET /score 404s are expected (job not yet processed) — do not fail on them.

config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 5
      name: warm
    - duration: 60
      arrivalRate: 15
      name: light
    - duration: 60
      arrivalRate: 40
      name: moderate
    - duration: 60
      arrivalRate: 80
      name: heavy
    - duration: 60
      arrivalRate: 150
      name: beyond-saturation
  http:
    timeout: 10

scenarios:
  - name: submit-interview
    weight: 80
    flow:
      - post:
          url: "/interviews"
          json:
            interview_id: "iv-{{ $randomNumber(1, 50) }}"

  - name: poll-score
    weight: 20
    flow:
      - get:
          # 404 until the job is scored — intentionally no expect block.
          url: "/score/iv-{{ $randomNumber(1, 50) }}"